import "../static/fonts.css";
import HomeTitleSection from "../components/home/HomeTitleSection";
import HomeAboutUs from "../components/home/HomeAboutUs";
import HomeCourseReasons from "../components/home/HomeCourseReasons";
import ReviewsCarousel from "../components/home/ReviewsCarousel";

const testimonials = {
  bilyana: {
    text: "Мис Лари не е просто учител, а ментор, вдъхновение и мотивация за децата да се развиват. Ентусиазмът и е заразителен, владее до съвършенство езика на децата и винаги усеща правилния път към сърцата им и към това да ги мотивира. Децата я обожават и наред с обучението по английски тя успява да ги увлече в завладяващи дискусии за здравословни навици, междуличностни отношение и други безценни теми, които ги правят сплотена група и добри и съвестни хора. Детето ми няма търпение за уроците по английски, защото са представени ангажиращо и под формата на игри, състезания и интересни казуси, които събуждат по най-правилния начин ентусиазма на децата да се справят с различни ситуации - разбира се разсъждавайки и изразявайки се на английски.",
    parentName: "Биляна",
    date: "12 септ. 2024 г.",
  },
  anonimen: {
    text: "Записахме нашият син на уроци по английски език при мис Лари, след като той в продължение на три години посещаваше друга школа и внезапно се оказа, че в средата на първи клас не знае буквите и съответно не може нито да чете, нито да пише. Сега, в началото на втори клас, той не само чете гладко непознати текстове на английски език, но успешно съчинява и пише сам кратки истории! Мис Лари има уникален подход на преподаване, използва много помощни материали, игри, песни и асоциации, които помагат на децата лесно да схванат и запомнят материала. Тя е жизнерадостна и винаги усмихната, но умее да изисква от децата и те я възприемат като авторитет. Синът ни напредна в английския много за няколко месеца, но за нас най-важното е, че ходи на уроците с удоволствие и придоби самоувереност!",
    parentName: "Анонимен",
    date: "15 септ. 2024 г.",
  },
  polina: {
    text: "Няма по-голяма радост от това да видиш децата си развълнувани и нетърпеливи да отидат на урок. Да видиш широките им усмивки в края на урока и желанието да разкажат какво ново са научили. Лари и Дари успяват да превърнат учебната зала в едно вълшебно и радостно място. Даряват децата със знания и умения, вдъхновение и ентусиазъм да постигат мечтите си!",
    parentName: "Полина",
    date: "18 септ. 2024 г.",
  },
  nikola: {
    text: "Мис Лари е изключително всеотдаен и талантлив учител. С нейна помощ, сина ми успя да изгради здрави основи на четене и писане в английския език: така важните първи стъпки… Винаги съм се впечатлявала от нейната дарба да бъде добър приятел на децата, но и в същото време да печели тяхното уважение като учител. В часовете на Мис Лари, децата лесно усвояват материала, чувстват се уверени и със самочувствие в способностите си, комфортно изразяват себе си и идеите си, както в час така и по време на изпити. Честите обратни връзки за развитието на сина ми са били винаги адекватни и професионални. Благодарим за всичко!",
    parentName: "майка на Никола Тенчев",
    date: "20 септ. 2024 г.",
  },
};

function HomePage() {
  return (
    <div>
      <HomeTitleSection />
      <ReviewsCarousel
        text={testimonials.bilyana.text}
        parentName={testimonials.bilyana.parentName}
        date={testimonials.bilyana.date}
      />
      <HomeCourseReasons />
      <ReviewsCarousel
        text={testimonials.nikola.text}
        parentName={testimonials.nikola.parentName}
        date={testimonials.nikola.date}
      />
      <HomeAboutUs />
      <ReviewsCarousel
        text={testimonials.polina.text}
        parentName={testimonials.polina.parentName}
        date={testimonials.polina.date}
      />
    </div>
  );
}

export default HomePage;
