import styles from "./ConcentrateCourse.module.css";

function ConcentrateCourse() {
  return (
    <div className={styles.container}>
      <div className={styles.title}>
        <h2>the</h2>
        <h1>concENtrate</h1>
        <h2>course</h2>
      </div>
      <div className={styles.description}>
        <p>
          Във времето на бързо сменящите се картини на екрана, но и бързо
          загубения интерес, на ярките и стимулиращи видеа, но бледия поглед към
          истинския свят - на детството в ерата на технологиите - едно от
          най-големите предизвикателства за децата се оказва да запазят
          КОНЦЕНТРАЦИЯ. Не защото не искат, не защото не им е интересно, а
          защото са привикнали към света онлайн. Така книгите вече не изглеждат
          така интересни, ученето е монотонно и скучно, игрите в реалния свят не
          са така вълнуващи... Но могат да бъдат! Нови времена - нови нужди -
          нови подходи! ConcENtrate е курс, който комбинира изучаването на
          английски език с методи за повишаване на концентрацията при децата.
          Разнообразието от игри и образователни задачи, забавни
          предизвикателства и творчески проекти помагат на децата да трупат
          практически знания и осъзнато да насочват вниманиено си към
          поставените цели. Защото ученето е интересно, а да знаеш и да можеш е
          истински вълнуващо - наистина, не онлайн!
        </p>
      </div>
    </div>
  );
}

export default ConcentrateCourse;
