import styles from "./EnlightenKidsCourse.module.css";

function EnlightenKidsCourse() {
  return (
    <div className={styles.container}>
      <div className={styles.title}>
        <h2>the</h2>
        <h1>ENlightEN Kids</h1>
        <h2>course</h2>
      </div>
      <div className={styles.description}>
        <p>
          В ENlightEN следваме два важни принципа: 1.Децата учат по-бързо от
          възрастните и това е доказано с редица научни изследвания. Чували сме
          израза "попиват като гъби". Това е така, защото в тази ранна възраст,
          мозъкът приема и запаметява информация по-бързо и по-лесно. 2.Децата
          са децата и обичат да играят! Следователно, трябва да играят! Когато
          съберем тези два принципа, откриваме формулата, по която най-успешно
          да дадем знания на децата, така че те да искат да учат и да усвояват
          качествено преподадения материал: Децата могат да научат много и с
          лекота, стига да е като на игра!
        </p>
        <p>
          Учим се да разбираме и да говорим на английски език, да четем и да
          пишем, развивайки въображението, логическата мисъл и уменията за
          учене. Под игрова форма трупаме знания и изграждаме умения, ключови за
          бъдещото развитие на малчуганите. И така, вместо задължение, уроците
          са очаквано приключение!
        </p>
      </div>
    </div>
  );
}

export default EnlightenKidsCourse;
